The highlighted lines lie on the axis.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId SculptingSingleLineLoopLiesOnAxis { get; }
  Visual Basic
Public Shared ReadOnly Property SculptingSingleLineLoopLiesOnAxis As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ SculptingSingleLineLoopLiesOnAxis {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace